
# 这是猴子名对应的英文
# dart飞镖猴q
# boomerang回旋镖猴w
# bomb大炮e
# tack图钉塔r
# ice冰猴t
# glue胶水炮手y
# sniper狙击手猴z
# sub猴子潜艇x
# buccaneer海盗猴c
# ace皇家飞行员v
# pilot直升机飞行员b
# mortar迫击炮猴n
# gunner机枪猴m
# wizard法师猴a
# super超猴侠s
# ninja忍者猴d
# alchemist炼金术士f
# druid德鲁伊g
# farm香蕉农场h
# engineer工程师猴l
# spike刺钉工厂j
# village猴子村k
# hero英雄u

# 英雄1=[大炮,[447,435]]
# 英雄1=[飞镖猴,[447,435]]
# 英雄1=[回旋镖猴,[447,435]]
# 英雄1=[大炮,[447,435]]
# 英雄1=[图钉塔,[447,435]]
# 英雄1=[冰猴,[447,435]]
# 英雄1=[胶水炮手,[447,435]]
# 英雄1=[狙击手猴,[447,435]]
# 英雄1=[猴子潜艇,[447,435]]
# 英雄1=[海盗船,[447,435]]
# 英雄1=[皇家飞行员,[447,435]]
# 英雄1=[迫击炮猴,[447,435]]
# 英雄1=[机枪猴,[447,435]]
# 英雄1=[法师猴,[447,435]]
# 英雄1=[超猴侠,[447,435]]
# 英雄1=[忍者猴,[447,435]]
# 英雄1=[炼金术士,[447,435]]
# 英雄1=[德鲁伊,[447,435]]
# 英雄1=[香蕉农场,[447,435]]
# 英雄1=[工程师猴,[447,435]]
# 英雄1=[刺钉工厂,[447,435]]
# 英雄1=[猴子村,[447,435]]
# 英雄1=[英雄,[447,435]]

# 英雄1=[飞镖猴,[447,435]]
# 英雄1=[回旋镖猴,[447,435]]
# 英雄1=[海盗船,[447,435]]
# 英雄1=[皇家飞行员,[447,435]]
# 英雄1=[忍者猴,[447,435]]
# 英雄1=[工程师猴,[447,435]]

# input()
# #仅初级
# 英雄1=[英雄,[447,435]]
# 回旋镖猴1=[回旋镖猴,[447,435]]
# 回旋镖猴2=[回旋镖猴,[447,435]]
# 飞镖猴1=[飞镖猴,[447,435]]
# 飞镖猴2=[飞镖猴,[447,435]]
# up402()
英雄=[英雄,[411,241]]
忍者=[忍者猴,[461,243]]
炼金1=[炼金术士,[439,200]]
炼金2=[炼金术士,[438,690]]
炼金3=[炼金术士,[618,107]]
刺钉=[刺钉工厂,[421,739]]
法师=[法师猴,[516,244]]
猴村1=[猴子村,[508,696]]
猴村2=[猴子村,[515,174]]
飞机=[皇家飞行员,[628,229]]
fz_(*英雄)
startgame(2)
fz_(*忍者)
up101(*忍者)
up301(*忍者)
fz_(*炼金1)
up401(*炼金1)
up401(*忍者)
fz_(*刺钉)
tab(*英雄,3)
fz_(*法师)
up201(*法师)
up401(*炼金1)
up020(*刺钉)
up205(*法师)
fz_(*猴村1)
up002(*猴村1)
up023(*刺钉)
tab(*刺钉,3)
up024(*刺钉)
fz_(*飞机)
tab(*飞机,1)
up401(*飞机)
up025(*刺钉)
up202(*猴村1)
fz_(*炼金2)
up400(*炼金2)
fz_(*猴村2)
up200(*猴村2)
up501(*飞机)
fz_(*炼金3)
up420(*炼金3)