# 这是猴子名对应的英文
# dart飞镖猴q
# boomerang回旋镖猴w
# bomb大炮e
# tack图钉塔r
# ice冰猴t
# glue胶水炮手y
# sniper狙击手猴z
# sub猴子潜艇x
# buccaneer海盗猴c
# ace皇家飞行员v
# pilot直升机飞行员b
# mortar迫击炮猴n
# gunner机枪猴m
# wizard法师猴a
# super超猴侠s
# ninja忍者猴d
# alchemist炼金术士f
# druid德鲁伊g
# farm香蕉农场h
# engineer工程师猴l
# spike刺钉工厂j
# village猴子村k
# hero英雄u
# #   394<x<1128猴村/1133/1147 26<y<728
# 2个大猴子相差86 中猴子要隔开上下隔开47左右46小猴子上下隔开46左右隔开47(中猴子体积23.2/24)小猴子23
# 改猴 坐标都xy需要变化 x-1,y+1
# '':['','''
# '''],
all_chains = {
    # 'mapname':{'modename':[[heroname],[chain]]},


    '猴子草甸': {
        '中级': ['萨乌达', '''
dart=[飞镖猴,[171,280]]
sawuda=[英雄,[346,366]]
tack=[图钉塔,[472,271]]
ice=[冰猴,[751,491]]
alchemist=[炼金术士,[354,283]]
village=[猴子村,[459,368]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
        '点击': ['萨乌达', '''
英雄1=[英雄,[458,385]]
忍者猴1=[忍者猴,[456,274]]
直升机飞行员1=[直升机飞行员,[661,360]]
炼金术士1=[炼金术士,[520,372]]
猴子村1=[猴子村,[531,271]]
直升机飞行员2=[直升机飞行员,[669,261]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    ''']
    },
    '树桩': {'中级': ['萨乌达', '''
dart=[飞镖猴,[209,200]]
sawuda=[英雄,[371,181]]
tack=[图钉塔,[329,87]]
ice=[冰猴,[1007,433]]
alchemist=[炼金术士,[313,223]]
village=[猴子村,[278,135]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
           '点击': ["萨乌达", '''
英雄1=[英雄,[369,191]]
忍者猴1=[忍者猴,[372,261]]
直升机飞行员1=[直升机飞行员,[291,86]]
炼金术士1=[炼金术士,[315,234]]
猴子村1=[猴子村,[226,174]]
直升机飞行员2=[直升机飞行员,[144,245]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],
           },


'道路中间': {
    '中级': ['萨乌达', '''
dart=[飞镖猴,[825,395]]
毛毛=[飞镖猴,[393,373]]
sawuda=[英雄,[337,345]]
ice=[冰猴,[826,401]]
alchemist=[炼金术士,[343,409]]
village=[猴子村,[427,316]]
village2=[猴子村,[427,316]]
fz(sawuda)
startgame()
fz(毛毛)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(毛毛)
up203(ice)
fz(village)
up400(village)
up401(alchemist)
up205(毛毛)

'''],

    '仅初级': ['任意英雄', '''
毛毛1=[飞镖猴,[342,357]]
大炮1=[大炮,[343,312]]
凯莉1=[回旋镖猴,[395,325]]
##########
fz(毛毛1)
startgame(2)
fz(大炮1)
tab(大炮1,3)
up024(毛毛1)
up030(大炮1)
fz(凯莉1)
up204(凯莉1)

'''],

    '只限魔法猴': ['任意英雄', '''
忍者1=[忍者猴,[371,353]]
炼金1=[炼金术士,[390,391]]
法爷1=[法师猴,[337,385]]
##########
fz(忍者1)
startgame(2)
up101(忍者1)
up301(忍者1)
fz(炼金1)
up300(炼金1)
up401(忍者1)
fz(法爷1)
up024(法爷1)
aimtool(法爷1,[498,349])
up401(炼金1)
up025(法爷1)

'''],

    '仅限军事': ['任意英雄', '''
狙击1=[狙击手猴,[943,201]]
潜艇1=[猴子潜艇,[953,459]]
直升机1=[直升机飞行员,[362,365]]
##########
fz(潜艇1)
startgame(2)
up002(潜艇1)
fz(狙击1)
tab(狙击1,3)
up110(狙击1)
fz(直升机1)
up320(直升机1)
up202(潜艇1)
up420(直升机1)
'''],

    '点击': ['昆西', '''
英雄1=[英雄,[338,348]]
忍者猴1=[忍者猴,[349,303]]
直升机飞行员1=[直升机飞行员,[422,471]]
炼金术士1=[炼金术士,[348,414]]
猴子村1=[猴子村,[443,378]]
直升机飞行员2=[直升机飞行员,[425,285]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)

'''],
},

    '市中心': {'中级': ['萨乌达', '''
dart=[飞镖猴,[296,610]]
sawuda=[英雄,[407,322]]
tack=[图钉塔,[413,233]]
ice=[冰猴,[865,331]]
alchemist=[炼金术士,[354,232]]
village=[猴子村,[338,339]]
fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
            # 下面这个没过
            '点击': ["昆西", '''
英雄1=[英雄,[400,341]]
忍者猴1=[忍者猴,[330,340]]
直升机飞行员1=[直升机飞行员,[214,185]]
炼金术士1=[炼金术士,[256,348]]
猴子村1=[猴子村,[244,273]]
直升机飞行员2=[直升机飞行员,[160,349]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],
            },
    '一二三': {'中级': ['萨乌达', '''
dart=[飞镖猴,[100,699]]
sawuda=[英雄,[148,600]]
tack=[图钉塔,[200,582]]
ice=[冰猴,[340,294]]
alchemist=[炼金术士,[176,708]]
忍者=[忍者猴,[235,702]]
fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(忍者)
up024(忍者)
'''],
            '点击': ["萨乌达", '''
英雄=[英雄,[147,608]]
炼金=[炼金术士,[144,563]]
炼金1=[炼金术士,[885,445]]
忍者=[忍者猴,[202,609]]
直升机=[直升机飞行员,[341,627]]
法师=[法师猴,[316,545]]
永钉=[刺钉工厂,[1000,427]]
冰猴1=[冰猴,[197,554]]
fz(英雄)
startgame(2)
fz(忍者)
up101(忍者)
up201(忍者)
fz(炼金)
up200(炼金)
fz(直升机)
up202(直升机)
up402(忍者)
up302(直升机)
fz(法师)
up024(法师)
up401(炼金)
up402(直升机)
up025(法师)
fz(炼金1)
fz(永钉)
up204(永钉)
tab(永钉,3)
up420(炼金1)
up205(永钉)
fz(冰猴1)
up420(冰猴1)
up520(冰猴1)
    '''],

            },
    '废料场': {'中级': ['萨乌达', '''
ice=[冰猴,[1032,659]]
dart=[飞镖猴,[161,601]]
sawuda=[英雄,[483,440]]
tack=[图钉塔,[477,484]]
alchemist=[炼金术士,[481,395]]
village=[猴子村,[581,474]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
            '点击': ["萨乌达", '''
英雄1=[英雄,[445,615]]
忍者猴1=[忍者猴,[375,609]]
直升机飞行员1=[直升机飞行员,[1068,668]]
炼金术士1=[炼金术士,[285,638]]
猴子村1=[猴子村,[1059,574]]
直升机飞行员2=[直升机飞行员,[1060,462]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],
            },
    '小木屋': {'中级': ['萨乌达', '''
sawuda=[英雄,[410,37]]
dart=[飞镖猴,[770,79]]
tack=[图钉塔,[470,101]]
ice=[冰猴,[490,618]]
alchemist=[炼金术士,[394,152]]
village=[猴子村,[469,171]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
            '点击': ['萨乌达', '''
英雄1=[英雄,[328,113]]
忍者猴1=[忍者猴,[403,154]]
直升机飞行员1=[直升机飞行员,[291,540]]
炼金术士1=[炼金术士,[333,189]]
猴子村1=[猴子村,[403,567]]
直升机飞行员2=[直升机飞行员,[511,586]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up300(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
'''],
            },
    '度假胜地': {'中级': ['萨乌达', '''
ice=[冰猴,[252,534]]
dart=[飞镖猴,[242,139]]
sawuda=[英雄,[916,138]]
tack=[图钉塔,[923,182]]
alchemist=[炼金术士,[965,47]]
village=[猴子村,[1059,166]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
             '点击': ['任意英雄', '''
tack=[图钉塔,[937,160]]
startgame(2)
spike=[刺钉工厂,[1100,142]]
fz(tack)
up101(tack)
fz(spike)
up002(spike)
tab(spike,3)
up202(tack)
up103(spike)
up302(tack)
up204(spike)
up402(tack)
up205(spike)
up502(tack)
tab(tack,3)
'''],
             },
    '溜冰鞋': {'中级': ['萨乌达', '''
ice=[冰猴,[932,651]]
dart=[飞镖猴,[398,541]]
sawuda=[英雄,[199,221]]
tack=[图钉塔,[249,222]]
alchemist=[炼金术士,[229,180]]
village=[猴子村,[220,312]]

fz(sawuda)
startgame()
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
            '极难': ['任意英雄', '''
buccaneer([561,429])
key(Key.space)
time.sleep(1)
key(Key.space)
buccaneer([624,387])
hero([530,513])
dart([110,264])
buccaneer([561,429],'022')
buccaneer([561,429],'023')
buccaneer([624,387],'023')
sniper([486,619])
sniper([486,619],'024')
buccaneer([683,339])
buccaneer([683,339],'023')
buccaneer([709,283])
buccaneer([709,283],'022')
buccaneer([712,205])
buccaneer([712,205],'022')
buccaneer([712,205],'024')
buccaneer([709,283],'024')
buccaneer([561,429],'024')
buccaneer([655,151])
buccaneer([581,168])
buccaneer([541,213])
buccaneer([559,342])
buccaneer([605,266])
buccaneer([624,387],'024')

# 升级024
buccaneer([683,339],'024')
buccaneer([709,283],'024')
buccaneer([655,151],'024')
pilot([750,536])
pilot([750,536],'230')
pilot([1003,711])
pilot([1003,711],'203')

buccaneer([581,168],'024')
buccaneer([541,213],'024')
buccaneer([559,342],'024')
sniper([486,619],'025')
pilot([1003,711],'204')
buccaneer([605,266],'025')
alchemist([226,214])
alchemist([224,320])
alchemist([239,382])
alchemist([275,455])
alchemist([342,499])
alchemist([345,423])
alchemist([330,351])
pilot([1003,711],'205')
spike([1109,575])
spike([1109,575],'205')
# 升级302
alchemist([226,214],'005')
alchemist([224,320],'042')
alchemist([239,382],'042')
alchemist([275,455],'042')
alchemist([342,499],'042')
alchemist([345,423],'042')
alchemist([330,351],'042')
village([348,246])
village([348,246],'230')

pilot([750,536],'240')
pilot([133,95])
pilot([133,95],'240')
# s=刷飞机
while True:
 key("3",times=6)
 key("4")
 time.sleep(2)
 click([110,264])
 time.sleep(2)
 click([68,300])
 time.sleep(2)
 key("4")
 time.sleep(2)
 click([68,300])
 time.sleep(2)
 click([110,264])
 time.sleep(2)
'''],
            '点击': ['萨乌达', '''
英雄1=[英雄,[208,215]]
忍者猴1=[忍者猴,[194,308]]
炼金术士1=[炼金术士,[279,298]]
直升机飞行员1=[直升机飞行员,[373,125]]
直升机飞行员2=[直升机飞行员,[311,372]]
猴子村1=[猴子村,[345,255]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up300(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],

            },
    '莲花岛': {'中级': ['萨乌达', '''
ice=[冰猴,[855,114]]
dart=[飞镖猴,[921,716]]
sawuda=[英雄,[625,659]]
tack=[图钉塔,[676,649]]
alchemist=[炼金术士,[723,631]]
village=[猴子村,[699,563]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
            '点击': ["萨乌达", '''
英雄1=[英雄,[932,628]]
忍者猴1=[忍者猴,[756,597]]
炼金术士1=[炼金术士,[829,502]]
直升机飞行员1=[直升机飞行员,[747,393]]
直升机飞行员2=[直升机飞行员,[932,490]]
猴子村1=[猴子村,[852,406]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],
            },
    '糖果瀑布': {
        '简单': ['', '''
    '''],
        '中级': ['萨乌达', '''
ice=[冰猴,[985,199]]
dart=[飞镖猴,[279,249]]
sawuda=[英雄,[218,654]]
tack=[图钉塔,[276,664]]
alchemist=[炼金术士,[166,638]]
village=[猴子村,[293,565]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
        "点击": ['萨乌达', '''
英雄1=[英雄,[945,498]]
忍者猴1=[忍者猴,[266,658]]
炼金术士1=[炼金术士,[315,674]]
直升机飞行员1=[直升机飞行员,[394,690]]
直升机飞行员2=[直升机飞行员,[405,498]]
猴子村1=[猴子村,[322,571]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up300(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    
    '''],
    },
    '冬季公园': {'中级': ['萨乌达', '''
ice=[冰猴,[880,209]]
dart=[飞镖猴,[880,567]]
sawuda=[英雄,[301,197]]
tack=[图钉塔,[250,192]]
alchemist=[炼金术士,[300,149]]
village=[猴子村,[283,284]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],

'困难': ['帕特', '''
英雄1=[英雄,[281,177]]
海盗猴1=[海盗猴,[596,321]]
海盗猴2=[海盗猴,[647,355]]
海盗猴3=[海盗猴,[544,357]]
海盗猴4=[海盗猴,[599,406]]
猴子村1=[猴子村,[459,290]]
皇家飞行员1=[皇家飞行员,[453,180]]
皇家飞行员2=[皇家飞行员,[436,371]]
fz(海盗猴1)
startgame(2)
up020(海盗猴1)
up022(海盗猴1)
fz(英雄1)
up023(海盗猴1)
fz(海盗猴2)
up020(海盗猴2)
up023(海盗猴2)
fz(海盗猴3)
up020(海盗猴3)
up023(海盗猴3)
fz(海盗猴4)
up020(海盗猴4)
up023(海盗猴4)
fz(猴子村1)
up220(猴子村1)
# up230(猴子村1)
fz(皇家飞行员1)
up200(皇家飞行员1)
up204(皇家飞行员1)
fz(皇家飞行员2)
up002(皇家飞行员2)
up402(皇家飞行员2)
up502(皇家飞行员2)
up205(皇家飞行员1)
'''],
             '点击': ["昆西", '''
英雄1=[英雄,[506,197]]
忍者猴1=[忍者猴,[434,157]]
炼金术士1=[炼金术士,[393,200]]
直升机飞行员1=[直升机飞行员,[274,174]]
直升机飞行员2=[直升机飞行员,[276,307]]
猴子村1=[猴子村,[401,285]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up300(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],
             },
    '鬼脸南瓜': {'中级': ['萨乌达', '''
ice=[冰猴,[778,156]]
dart=[飞镖猴,[303,250]]
sawuda=[英雄,[529,486]]
tack=[图钉塔,[597,473]]
alchemist=[炼金术士,[601,529]]
village=[猴子村,[568,385]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
             '点击': ["萨乌达", '''
英雄1=[英雄,[606,481]]
忍者猴1=[忍者猴,[678,485]]
炼金术士1=[炼金术士,[532,480]]
直升机飞行员1=[直升机飞行员,[713,366]]
直升机飞行员2=[直升机飞行员,[495,363]]
猴子村1=[猴子村,[602,373]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],
             },
    '公园路径': {'中级': ['萨乌达', '''
ice=[冰猴,[1064,358]]
dart=[飞镖猴,[613,240]]
sawuda=[英雄,[798,577]]
tack=[图钉塔,[754,604]]
alchemist=[炼金术士,[700,526]]
village=[猴子村,[748,482]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
             '点击': ["萨乌达", '''
英雄1=[英雄,[686,170]]
忍者猴1=[忍者猴,[700,220]]
炼金术士1=[炼金术士,[763,189]]
直升机飞行员1=[直升机飞行员,[693,48]]
直升机飞行员2=[直升机飞行员,[902,122]]
猴子村1=[猴子村,[800,92]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],

             },
    '高山竞速': {'中级': ['萨乌达', '''
ice=[冰猴,[952,264]]
dart=[飞镖猴,[516,78]]
sawuda=[英雄,[394,449]]
tack=[图钉塔,[341,426]]
alchemist=[炼金术士,[348,482]]
village=[猴子村,[397,334]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
             '点击': ["萨乌达", '''
英雄1=[英雄,[524,486]]
忍者猴1=[忍者猴,[510,377]]
炼金术士1=[炼金术士,[452,363]]
直升机飞行员1=[直升机飞行员,[494,211]]
直升机飞行员2=[直升机飞行员,[368,280]]
猴子村1=[猴子村,[493,307]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],
             },
    '冰冻三尺': {'中级': ['萨乌达', '''
ice=[冰猴,[992,349]]
dart=[飞镖猴,[82,655]]
sawuda=[英雄,[366,612]]
tack=[图钉塔,[356,658]]
alchemist=[炼金术士,[461,583]]
village=[猴子村,[300,549]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
             '点击': ["萨乌达", '''
英雄1=[英雄,[361,630]]
忍者猴1=[忍者猴,[388,489]]
炼金术士1=[炼金术士,[531,540]]
直升机飞行员1=[直升机飞行员,[538,664]]
直升机飞行员2=[直升机飞行员,[621,570]]
猴子村1=[猴子村,[469,565]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],
             },
    '循环': {'中级': ['萨乌达', '''
ice=[冰猴,[407,209]]
dart=[飞镖猴,[358,591]]
sawuda=[英雄,[824,522]]
tack=[图钉塔,[765,530]]
alchemist=[炼金术士,[800,480]]
village=[猴子村,[727,475]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
           '点击': ["萨乌达", '''
英雄1=[英雄,[808,519]]
忍者猴1=[忍者猴,[734,526]]
炼金术士1=[炼金术士,[752,454]]
直升机飞行员1=[直升机飞行员,[601,325]]
直升机飞行员2=[直升机飞行员,[578,523]]
猴子村1=[猴子村,[618,429]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],
           },
    '立体主义': {'中级': ['萨乌达', '''
ice=[冰猴,[985,500]]
dart=[飞镖猴,[78,206]]
sawuda=[英雄,[664,488]]
tack=[图钉塔,[607,451]]
alchemist=[炼金术士,[655,436]]
village=[猴子村,[594,525]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
             '点击': ["萨乌达", '''
英雄1=[英雄,[447,435]]
忍者猴1=[忍者猴,[376,393]]
炼金术士1=[炼金术士,[414,342]]
直升机飞行员1=[直升机飞行员,[600,355]]
直升机飞行员2=[直升机飞行员,[420,247]]
猴子村1=[猴子村,[494,369]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],
             },
    '树篱': {'中级': ['萨乌达', '''
ice=[冰猴,[1062,398]]
dart=[飞镖猴,[499,214]]
sawuda=[英雄,[123,403]]
tack=[图钉塔,[227,401]]
alchemist=[炼金术士,[224,450]]
village=[猴子村,[118,475]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
           '点击': ["萨乌达", '''
英雄1=[英雄,[226,367]]
忍者猴1=[忍者猴,[166,319]]
炼金术士1=[炼金术士,[223,273]]
直升机飞行员1=[直升机飞行员,[113,242]]
直升机飞行员2=[直升机飞行员,[315,168]]
猴子村1=[猴子村,[208,204]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],
           },
    '四个圈子': {'中级': ['萨乌达', '''
ice=[冰猴,[563,655]]
dart=[飞镖猴,[766,67]]
sawuda=[英雄,[622,389]]
tack=[图钉塔,[579,358]]
alchemist=[炼金术士,[581,415]]
village=[猴子村,[662,319]]
fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
             '点击': ["萨乌达", '''
英雄1=[英雄,[447,435]]
忍者猴1=[忍者猴,[376,420]]
炼金术士1=[炼金术士,[414,342]]
直升机飞行员1=[直升机飞行员,[672,282]]
直升机飞行员2=[直升机飞行员,[446,274]]
猴子村1=[猴子村,[576,371]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],
             },
    '路的尽头': {'中级': ['萨乌达', '''
ice=[冰猴,[1028,440]]
dart=[飞镖猴,[190,428]]
sawuda=[英雄,[158,330]]
tack=[图钉塔,[297,276]]
alchemist=[炼金术士,[162,216]]
village=[猴子村,[280,373]]

fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
             '点击': ["萨乌达", '''
英雄1=[英雄,[266,361]]
忍者猴1=[忍者猴,[308,307]]
炼金术士1=[炼金术士,[372,302]]
直升机飞行员1=[直升机飞行员,[265,458]]
直升机飞行员2=[直升机飞行员,[431,468]]
猴子村1=[猴子村,[348,385]]
fz(英雄1)
startgame(2)
fz(忍者猴1)
up202(忍者猴1)
fz(炼金术士1)
up200(炼金术士1)
up402(忍者猴1)
up401(炼金术士1)
fz(直升机飞行员1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
    '''],
             },
    '原木': {
        '中级': ['萨乌达', '''
ice=[冰猴,[841,505]]
dart=[飞镖猴,[238,201]]
sawuda=[英雄,[351,496]]
tack=[图钉塔,[419,501]]
alchemist=[炼金术士,[344,415]]
village=[猴子村,[415,395]]
fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
'''],
        '点击': ['艾蒂安', '''
艾蒂安=[英雄,[338,325]]
胶水1=[胶水炮手,[391,321]]
炼金1=[炼金术士,[336,371]]
图钉1=[图钉塔,[389,364]]
冰猴1=[冰猴,[379,413]]
狙击手1=[狙击手猴,[465,485]]
大炮1=[大炮,[444,324]]
狙击手2=[狙击手猴,[418,484]]
狙击手3=[狙击手猴,[370,485]]
大炮2=[大炮,[542,486]]
fz(狙击手1)
startgame(2)
fz(狙击手2)
fz(狙击手3)
fz(艾蒂安)
up002(狙击手1)
up020(狙击手3)
up102(狙击手1)
up102(狙击手2)
fz(大炮1)
up204(大炮1)
猴村1=[猴子村,[445,400]]
fz(猴村1)
up002(猴村1)
up205(狙击手1)
tab(狙击手1,3)
fz(图钉1)
up205(图钉1)
up402(猴村1)
fz(冰猴1)
up240(冰猴1)
fz(炼金1)
up402(炼金1)
fz(胶水1)
up013(胶水1)
tab(胶水1,3)
tab(狙击手2,3)
up502(狙击手2)
up050(狙击手3)
up250(狙击手3)
fz(大炮2)
up204(大炮2)

'''],
    },
    # 中级图


    '采石场': {
        '点击': ['帕特', '''

英雄=[英雄,[407,382]]
飞镖1=[飞镖猴,[521,612]]
飞镖2=[飞镖猴,[578,608]]
飞镖3=[飞镖猴,[632,607]]
忍者=[忍者猴,[469,366]]
炼金=[炼金术士,[518,387]]
超猴1=[超猴侠,[577,354]]
超猴2=[超猴侠,[664,341]]
猴村1=[猴子村,[588,237]]
猴村2=[猴子村,[500,247]]
冰1=[冰猴,[685,226]]
冰2=[冰猴,[337,307]]
胶水=[胶水炮手,[411,279]]
fz(飞镖1)
fz(飞镖2)
fz(飞镖3)
tab(飞镖3,3)
startgame(2)
fz(英雄)
fz(忍者)
up101(忍者)
up302(忍者)
fz(炼金)
up300(炼金)
up402(忍者)
up401(炼金)
fz(超猴1)
fz(猴村1)
up002(猴村1)
fz(猴村2)
up002(猴村2)
up002(超猴1)
up302(超猴1)
up202(猴村2)
up501(炼金)
fz(超猴2)
up300(超猴2)
up022(猴村1)
up320(超猴2)
up302(猴村2)
fz(冰1)
up420(冰1)
fz(胶水)
up023(胶水)
tab(胶水,3)
fz(冰2)
up420(冰2)
'''], },
    '静谧街道': {'点击': ['萨乌达', '''
英雄=[英雄,[419,507]]
狙击1=[狙击手猴,[609,403]]
狙击2=[狙击手猴,[611,351]]
法师=[法师猴,[419,275]]
猴村=[猴子村,[379,217]]
刺钉=[刺钉工厂,[485,154]]
冰=[冰猴,[252,283]]
炼金1=[炼金术士,[427,130]]
炼金2=[炼金术士,[286,210]]
炼金3=[炼金术士,[228,624]]
炼金4=[炼金术士,[253,576]]
fz(英雄)
startgame(2)
fz(狙击1)
up100(狙击1)
tab(狙击1,3)
up102(狙击1)
fz(狙击2)
up011(狙击2)
up022(狙击2)
up202(狙击1)
fz(法师)
up203(法师)
up302(狙击1)
up205(法师)
fz(猴村)
up102(猴村)
fz(刺钉)
up204(刺钉)
tab(刺钉,3)
up302(猴村)
fz(冰)
up003(冰)
up205(冰)
up205(刺钉)
fz(炼金1)
up300(炼金1)
fz(炼金2)
up300(炼金2)
fz(炼金3)
up031(炼金3)
tab(炼金3,3)
fz(炼金4)
up031(炼金4)
tab(炼金4,3)
up402(狙击1)
up025(狙击2)
''']},
    '布隆纳留斯精英': {'点击': ['萨乌达', '''
萨乌达=[英雄,[212,67]]
狙击手=[狙击手猴,[617,45]]
狙击手1=[狙击手猴,[665,86]]
法师=[法师猴,[227,116]]
猴村=[猴子村,[500,115]]
炼金=[炼金术士,[573,118]]
炼金1=[炼金术士,[627,121]]
法师1=[法师猴,[550,230]]
永钉=[刺钉工厂,[602,207]]
地雷=[刺钉工厂,[902,543]]
胶水=[胶水炮手,[330,91]]
冰1=[冰猴,[355,276]]
冰2=[冰猴,[673,72]]
fz(萨乌达)
startgame(2)
fz(狙击手)
fz(法师)
up030(法师)
up003(狙击手)
up023(狙击手)
up024(狙击手)
fz(猴村)
up002(猴村)
fz(炼金)
tab(炼金,3)
up301(炼金)
up025(狙击手)
up202(猴村)
up401(炼金)
fz(法师1)
up205(法师1)
fz(永钉)
up004(永钉)
tab(永钉,3)
up025(永钉)
fz(炼金1)
up401(炼金1)
fz(狙击手1)
up420(狙击手1)
tab(狙击手1,3)
fz(冰1)
up420(冰1)
fz(胶水)
up023(胶水)
fz(地雷)
up320(地雷)
up420(地雷)
fz(冰2)
up420(冰2)
''']},
    '平衡': {'点击': ['萨乌达', '''
英雄=[英雄,[600,267]]
图钉=[图钉塔,[597,394]]
图钉1=[图钉塔,[623,481]]
炼金1=[炼金术士,[501,377]]
炼金2=[炼金术士,[489,281]]
猴村=[猴子村,[706,395]]
炮=[大炮,[704,274]]
冰1=[冰猴,[466,404]]
胶水=[胶水炮手,[727,500]]
船=[海盗猴,[617,589]]
fz(英雄)
startgame(2)
fz(图钉)
up003(图钉)
fz(炼金1)
up200(炼金1)
up204(图钉)
fz(猴村)
up020(猴村)
up401(炼金1)
up205(图钉)
up420(猴村)
fz(冰1)
up420(冰1)
up520(猴村)
tab(猴村,3)
fz(炮)
up204(炮)
up520(冰1)
fz(胶水)
up023(胶水)
tab(胶水,3)
fz(炼金2)
up401(炼金2)
fz(船)
up520(船)
fz(图钉1)
up402(图钉1)
''']},
    '鬼屋': {
        '点击': ["奥本", '''
潜艇1=[猴子潜艇,[567,410]]
潜艇2=[猴子潜艇,[629,413]]
英雄=[英雄,[766,386]]
忍者=[忍者猴,[767,328]]
炼金1=[炼金术士,[427,423]]
炼金2=[炼金术士,[773,456]]
飞镖=[飞镖猴,[142,517]]
猴村=[猴子村,[836,379]]
超猴1=[超猴侠,[783,523]]
超猴2=[超猴侠,[870,457]]
fz(潜艇1)
startgame(2)
fz(潜艇2)
fz(英雄)
fz(忍者)
up101(忍者)
up202(潜艇1)
fz(炼金1)
up301(炼金1)
up204(潜艇1)
fz(飞镖)
up002(飞镖)
fz(猴村)
up202(猴村)
fz(超猴1)
up002(超猴1)
up202(超猴1)
fz(炼金2)
up401(炼金2)
up302(超猴1)
up501(炼金2)
up401(忍者)
fz(超猴2)
up102(超猴2)
up302(超猴2)
up204(潜艇2)
    '''],
    },
    '龟裂之地': {'极难': ['艾蒂安', '''
刺钉=[刺钉工厂,[302,147]]
飞机1=[皇家飞行员,[451,102]]
图钉=[图钉塔,[302,147]]
刺钉厂=[刺钉工厂,[245,192]]
# 这个名字=[图钉塔,[302,147]]
飞机2=[皇家飞行员,[306,293]]
猴子村啊=[猴子村,[386,170]]
艾蒂安=[英雄,[409,264]]
fz(艾蒂安)
startgame()
fz(图钉)
fz(飞机1)
fz(飞机2)
fz(刺钉厂)
fz(猴子村啊)
up220(刺钉厂)
up202(图钉)
up230(刺钉厂)
up002(猴子村啊)
up205(图钉)
up203(猴子村啊)
up205(飞机1)
up502(飞机2)
up250(刺钉厂)
''']},
    '耙': {
        '点击': ['萨乌达', '''
英雄=[英雄,[769,408]]
飞镖=[飞镖猴,[769,667]]
潜艇=[猴子潜艇,[682,291]]
猴村=[猴子村,[873,501]]
永钉=[刺钉工厂,[972,605]]
狙击=[狙击手猴,[769,612]]
法师=[法师猴,[874,431]]
冰=[冰猴,[766,459]]
炼金1=[炼金术士,[969,515]]
炼金2=[炼金术士,[925,405]]
fz(英雄)
startgame(2)
fz(飞镖)
fz(潜艇)
up001(潜艇)
up021(潜艇)
dm([911,457])
fz(猴村)
up102(猴村)
fz(永钉)
up103(永钉)
tab(永钉,2)
fz(狙击)
up102(狙击)
tab(狙击,3)
up202(狙击)
up202(猴村)
fz(法师)
up204(法师)
up302(狙击)
up205(法师)
up104(永钉)
up402(狙击)
fz(冰)
up203(冰)
up402(猴村)
up204(冰)
up205(永钉)
fz(炼金1)
up401(炼金1)
up205(冰)
fz(炼金2)
up401(炼金2)
up024(潜艇)
''']},

    '': {'中级': ['萨乌达', '''
''']},
    '': {'中级': ['萨乌达', '''
''']},
    '': {'中级': ['萨乌达', '''
''']},
    '': {'中级': ['萨乌达', '''
''']},
    # 高级图
    '午夜豪宅': {'点击': ['格温多琳', '''
英雄=[英雄,[853,190]]
飞镖1=[飞镖猴,[202,200]]
飞镖2=[飞镖猴,[404,198]]
飞镖3=[飞镖猴,[452,195]]
飞镖4=[飞镖猴,[311,138]]
飞镖5=[飞镖猴,[425,137]]
德=[德鲁伊,[278,196]]
图钉1=[图钉塔,[923,191]]
图钉2=[图钉塔,[881,229]]
炼金=[炼金术士,[865,121]]
猴村=[猴子村,[938,84]]
冰1=[冰猴,[1001,212]]
冰2=[冰猴,[648,210]]
冰3=[冰猴,[500,205]]
法=[法师猴,[703,119]]
胶水=[胶水炮手,[763,127]]
狙击=[狙击手猴,[258,91]]
fz(飞镖1)
fz(飞镖2)
fz(飞镖3)
startgame(2)
fz(飞镖4)
fz(飞镖5)
fz(英雄)
fz(德)
up030(德)
up022(飞镖4)
up032(飞镖4)
up130(德)
fz(图钉1)
up203(图钉1)
up032(飞镖1)
up204(图钉1)
fz(炼金)
up320(炼金)
dm([964,77])
fz(猴村)
#好像40要放技能
up020(猴村)
up320(猴村)
up420(炼金)
up205(图钉1)
up420(猴村)
fz(图钉2)
up402(图钉2)
up502(图钉2)
tab(图钉2,2)
fz(法)
up025(法)
fz(冰1)
up420(冰1)
fz(胶水)
up023(胶水)
tab(胶水,3)
fz(冰2)
up420(冰2)
fz(冰3)
up420(冰3)
''']},
    '凹陷的柱子': {
        '点击': ["萨乌达", '''
英雄=[英雄,[569,121]]
图钉1=[图钉塔,[510,94]]
图钉2=[图钉塔,[612,97]]
炼金=[炼金术士,[659,79]]
刺钉=[刺钉工厂,[592,618]]
猴村=[猴子村,[570,50]]
猴村1=[猴子村,[638,505]]
炼金1=[炼金术士,[664,656]]
炼金2=[炼金术士,[483,35]]
fz(英雄)
startgame(2)
fz(图钉1)
up002(图钉1)
up202(图钉1)
fz(图钉2)
up002(图钉2)
up203(图钉2)
up302(图钉1)
fz(炼金)
up200(炼金)
fz(刺钉)
up103(刺钉)
tab(刺钉,1)
fz(猴村)
up200(猴村)
up104(刺钉)
up204(图钉2)
up300(猴村)
up402(图钉1)
up320(猴村)
up420(猴村)
up205(图钉2)
up420(炼金)
up502(图钉1)
up205(刺钉)
fz(猴村1)
up200(猴村1)
fz(炼金1)
up420(炼金1)
fz(炼金2)
up420(炼金2)
    '''],
    },
    '': {
        '': ["", '''
    '''],
    },
    '': {
        '': ["", '''
    '''],
    },

    '货运': {
        '点击': ["萨乌达", '''
英雄=[英雄,[854,257]]
潜艇1=[猴子潜艇,[348,102]]
潜艇2=[猴子潜艇,[294,116]]
炼金1=[炼金术士,[317,170]]
炼金2=[炼金术士,[491,342]]
炼金3=[炼金术士,[677,416]]
炼金4=[炼金术士,[623,586]]
飞镖=[飞镖猴,[143,169]]
胶水=[胶水炮手,[667,545]]
猴村=[猴子村,[568,434]]
刺钉1=[刺钉工厂,[433,347]]
刺钉2=[刺钉工厂,[507,388]]
超猴=[超猴侠,[660,360]]
法师=[法师猴,[590,351]]
回1=[回旋镖猴,[638,448]]
回2=[回旋镖猴,[498,438]]
回3=[回旋镖猴,[627,495]]
回4=[回旋镖猴,[569,498]]
fz(英雄)
startgame(2)
fz(潜艇1)
up002(潜艇1)
fz(炼金1)
up200(炼金1)
up203(潜艇1)
fz(飞镖)
up002(飞镖)
up300(炼金1)
fz(潜艇2)
up203(潜艇2)
up401(炼金1)
fz(胶水)
fz(猴村)
up102(猴村)
fz(刺钉1)
up202(刺钉1)
tab(刺钉1,3)
up302(刺钉1)
fz(炼金2)
up301(炼金2)
up202(猴村)
up402(刺钉1)
fz(超猴)
up003(超猴)
up203(超猴)
fz(炼金3)
up300(炼金3)
fz(法师)
up025(法师)
up401(炼金2)
fz(刺钉2)
up202(刺钉2)
tab(刺钉2,3)
up205(刺钉2)
up302(猴村)
up023(胶水)
tab(胶水,3)
fz(炼金4)
up031(炼金4)
fz(回1)
up204(回1)
tab(回1,3)
fz(回2)
up204(回2)
fz(回3)
up204(回3)
fz(回4)
up204(回4)
tab(回3,3)
tab(回4,3)
up204(潜艇1)
up204(潜艇2)
    '''],
    },
    '高级金融': {
        '点击': ["萨乌达", '''
英雄=[英雄,[683,620]]
潜艇=[猴子潜艇,[601,335]]
船=[海盗猴,[650,459]]
猴村=[猴子村,[663,522]]
法师1=[法师猴,[500,622]]
法师2=[法师猴,[593,529]]
忍者=[忍者猴,[498,578]]
炼金=[炼金术士,[537,526]]
刺钉=[刺钉工厂,[666,302]]
飞镖=[飞镖猴,[587,394]]
fz(英雄)
startgame(2)
fz(潜艇)
fz(船)
up010(船)
fz(猴村)
up220(船)
up320(船)
fz(法师1)
fz(忍者)
up030(法师1)
fz(法师2)
up003(法师2)
up103(法师2)
up130(法师1)
up204(法师2)
up200(猴村)
up205(法师2)
up520(船)
fz(炼金)
up420(炼金)
tab(炼金,3)
fz(刺钉)
up203(刺钉)
tab(刺钉,3)
up205(刺钉)
fz(飞镖)
up025(飞镖)
up420(猴村)
up032(潜艇)
up401(忍者)
    '''],},

    '另一块砖': {

        '极难': ["艾蒂安", '''
英雄=[英雄,[411,241]]
忍者=[忍者猴,[461,243]]
炼金1=[炼金术士,[439,200]]
炼金2=[炼金术士,[438,690]]
炼金3=[炼金术士,[618,107]]
刺钉=[刺钉工厂,[421,739]]
法师=[法师猴,[516,244]]
猴村1=[猴子村,[508,696]]
猴村2=[猴子村,[515,174]]
飞机=[皇家飞行员,[628,229]]
飞机2=[皇家飞行员,[468,95]]
航母=[海盗猴,[905,205]]
fz(英雄)
startgame(2)
fz(忍者)
up101(忍者)
fz(猴村2)
up002(猴村2)
up301(忍者)
fz(炼金1)
up401(炼金1)
up401(忍者)

# fz(刺钉)
tab(英雄,3)
fz(法师)
up201(法师)
up401(炼金1)
up203(猴村2)
up205(法师)

fz(飞机)
tab(飞机,1)
up401(飞机)
up501(飞机)
fz(飞机2)
up205(飞机2)
fz(航母)
up520(航母)
up501(炼金1)
    '''],

        '点击': ["萨乌达", '''
英雄=[英雄,[411,241]]
忍者=[忍者猴,[461,243]]
炼金1=[炼金术士,[439,200]]
炼金2=[炼金术士,[438,690]]
炼金3=[炼金术士,[618,107]]
刺钉=[刺钉工厂,[421,739]]
法师=[法师猴,[516,244]]
猴村1=[猴子村,[508,696]]
猴村2=[猴子村,[515,174]]
飞机=[皇家飞行员,[628,229]]
fz(英雄)
startgame(2)
fz(忍者)
up101(忍者)
up301(忍者)
fz(炼金1)
up301(炼金1)
up401(忍者)
fz(刺钉)
tab(英雄,3)
fz(法师)
up201(法师)
up023(刺钉)
up205(法师)
fz(猴村1)
up002(猴村1)
up023(刺钉)
tab(刺钉,3)
up024(刺钉)
fz(飞机)
tab(飞机,1)
up401(飞机)
up025(刺钉)
up202(猴村1)
fz(炼金2)
up400(炼金2)
fz(猴村2)
up200(猴村2)
up501(飞机)
fz(炼金3)
up420(炼金3)
    '''],
    },

    '海岸': {
        '点击': ["艾蒂安", '''
英雄=[英雄,[338,366]]
飞镖1=[飞镖猴,[202,245]]
飞镖2=[飞镖猴,[525,88]]
飞镖3=[飞镖猴,[794,149]]
潜艇=[猴子潜艇,[984,427]]
潜艇1=[猴子潜艇,[921,441]]
潜艇2=[猴子潜艇,[860,441]]
狙击=[狙击手猴,[546,474]]
炼金=[炼金术士,[1026,370]]
炼金1=[炼金术士,[861,213]]
炼金2=[炼金术士,[394,575]]
法师=[法师猴,[800,314]]
飞机=[皇家飞行员,[963,232]]
猴村=[猴子村,[915,341]]
胶水=[胶水炮手,[269,359]]
fz(飞镖1)
fz(飞镖2)
fz(飞镖3)
tab(飞镖1,1)
tab(飞镖2,1)
startgame(2)
fz(潜艇)
up001(潜艇)
fz(英雄)
up202(潜艇)
fz(狙击)
up100(狙击)
tab(狙击,3)
up203(潜艇)
fz(炼金)
up300(炼金)
up204(潜艇)
up401(炼金)
fz(法师)
up022(法师)
fz(飞机)
up302(飞机)
up025(法师)
up302(飞机)
run_thread(abilities,('12',))
up402(飞机)
fz(猴村)
# up200(猴村)
up202(猴村)
fz(炼金1)
up401(炼金1)
up502(飞机)
up402(狙击)
fz(潜艇1)
up204(潜艇1)
fz(炼金2)
up031(炼金2)
tab(炼金2,3)
fz(胶水)
up023(胶水)
tab(胶水,3)
fz(潜艇2)
up240(潜艇2)
#补充输出
    '''],
    },
    '玉米地': {'点击': ['萨乌达', '''
英雄=[英雄,[537,340]]
fz(英雄) 
startgame(2)
飞镖猴1=[飞镖猴,[541,385]]
法师猴1=[法师猴,[537,444]]
猴村1=[猴子村,[608,444]]
fz(飞镖猴1)
tab(飞镖猴1,1)
up320(飞镖猴1)
fz(法师猴1)
up202(法师猴1)
up420(飞镖猴1)
up204(法师猴1)
刺钉1=[刺钉工厂,[640,381]]
fz(刺钉1)
up203(刺钉1)
tab(刺钉1,3)
炼金1=[炼金术士,[587,390]]
fz(炼金1)
up301(炼金1)
up520(飞镖猴1)
fz(猴村1)
up420(猴村1)
up205(法师猴1)
图钉1=[图钉塔,[605,337]]
fz(图钉1)
up402(图钉1)
up205(刺钉1)
up402(炼金1)
up520(猴村1)
''']},


    '': {
        '': ["", '''
    '''],
    },
    '': {
        '': ["", '''
    '''],
    },
    '': {
        '': ["", '''
    '''],
    },
    '': {
        '': ["", '''
    '''],
    },
    '': {
        '': ["", '''
    '''],
    },
    '': {
        '': ["", '''
    '''],
    },
    '': {
        '': ["", '''
    '''],
    },
    '': {
        '': ["", '''
    '''],
    },
    '': {
        '': ["", '''
    '''],
    },
    '': {
        '': ["", '''
    '''],
    },
    '': {
        '': ["", '''
    '''],
    },
    '': {
        '': ["", '''
    '''],
    },
    '': {
        '': ["", '''

    '''],
        '点击': ["萨乌达", '''

    '''],
    },
    '隐蔽的花园': {
        '点击': ["萨乌达", '''
英雄1=[英雄,[101,473]]
狙击手猴1=[狙击手猴,[44,557]]
飞镖猴1=[飞镖猴,[1127,350]]
法师猴1=[法师猴,[98,563]]
直升机飞行员1=[直升机飞行员,[80,391]]
炼金术士1=[炼金术士,[51,467]]
猴子村1=[猴子村,[78,304]]
直升机飞行员2=[直升机飞行员,[77,216]]
fz(英雄1)
startgame(2)
fz(狙击手猴1)
tab(狙击手猴1,3)
fz(飞镖猴1)
fz(法师猴1)
up020(法师猴1)
fz(直升机飞行员1)
up100(狙击手猴1)
up200(直升机飞行员1)
up022(法师猴1)
up300(直升机飞行员1)
fz(炼金术士1)
up300(炼金术士1)
up032(法师猴1)
up302(直升机飞行员1)
fz(猴子村1)
up220(猴子村1)
fz(直升机飞行员2)
up203(直升机飞行员2)
up402(直升机飞行员1)
up204(直升机飞行员2)
up502(直升机飞行员1)
up230(猴子村1)
up205(直升机飞行员2)
up420(狙击手猴1)
    '''],
    },


    '地下': {
        '': ["", '''

    '''],
        '点击': ["萨乌达", '''
英雄=[英雄,[821,377]]
图钉1=[图钉塔,[719,384]]
图钉2=[图钉塔,[603,378]]
炼金=[炼金术士,[658,356]]
炼金2=[炼金术士,[576,428]]
猴村1=[猴子村,[661,413]]
猴村2=[猴子村,[668,513]]
法师=[法师猴,[490,381]]
超猴=[超猴侠,[583,520]]
回旋镖=[回旋镖猴,[533,423]]
胶水=[胶水炮手,[585,437]]
狙击1=[狙击手猴,[637,573]]
狙击2=[狙击手猴,[756,472]]
狙击3=[狙击手猴,[740,512]]
fz(英雄)
startgame(2)
fz(图钉1)
up003(图钉1)
up203(图钉1)
fz(炼金)
tab(炼金,3)
up302(炼金)#升下2补输出
fz(猴村1)
fz(法师)
up020(法师)
up200(猴村1)
up022(法师)
aimcamo(法师)
#漏迷彩

up204(图钉1)
up300(猴村1)#
ability('1',cd=1.6)#丢技能防rng
# up400(猴村1)#40要补输出,但是会抢buff
# ability('1',cd=1.6)#丢漏迷彩

up320(猴村1)
up420(猴村1)

fz(回旋镖)#补的
up012(回旋镖)#防漏铅
fz(图钉2)
up102(图钉2)
up402(图钉2)
up420(猴村1)#
up022(回旋镖)

up205(图钉1)#54会rng
fz(猴村2)
up002(猴村2)
up401(炼金)
up024(回旋镖)
tab(回旋镖,3)
fz(胶水)
up013(胶水)#原023
tab(胶水,3)
fz(超猴)
up201(超猴)
up301(超猴)
run_thread(abilities,('12',))
up502(图钉2)#拖到93没出会g，92有概率g
tab(图钉2,2)
fz(狙击1)
tab(狙击1,3)
up402(狙击1)
fz(狙击3)
tab(狙击3,3)
up402(狙击3)
up024(胶水)
fz(狙击2)
up204(狙击2)
tab(狙击2,3)

    '''],
    },

    '': {
        '': ["", '''
    '''],
    },

    # 专家图
'黑暗地下城': {
    '简单': ['灵机', '''
毛=[飞镖猴,[209,582]]
毛2=[飞镖猴,[567,677]]
毛3=[飞镖猴,[952,739]]
狙=[狙击手猴,[421,174]]
毛4=[飞镖猴,[177,644]]
潜=[猴子潜艇,[1042,642]]
杰=[英雄,[532,711]]
德=[德鲁伊,[158,580]]
德2=[德鲁伊,[553,634]]
德3=[德鲁伊,[1106,309]]
飞机=[皇家飞行员,[426,344]]
村=[猴子村,[413,426]]
炼金=[炼金术士,[427,482]]
飞机2=[皇家飞行员,[524,450]]
扎脚=[刺钉工厂,[291,365]]
法=[法师猴,[1107,527]]
图钉=[图钉塔,[640,669]]
图钉2=[图钉塔,[919,175]]
炼金2=[炼金术士,[277,319]]
冰=[冰猴,[473,179]]
德4=[德鲁伊,[71,271]]
村2=[猴子村,[1011,223]]
冰2=[冰猴,[893,214]]
炼金3=[炼金术士,[993,165]]
村3=[猴子村,[773,682]]
图钉3=[图钉塔,[919,248]]
直升机=[直升机飞行员,[1006,327]]
图钉4=[图钉塔,[506,214]]
##########
fz(毛)
fz(毛2)
fz(毛3)
startgame(2)#快速
fz(狙)
up010(毛3)
fz(毛4)
tab(毛4,3)
tab(毛2,3)
fz(潜)
fz(杰)
fz(德)
fz(德2)
tab(德,3)
up010(德)
up010(德2)
fz(德3)
tab(德3,3)
up110(德)
up100(德3)
up110(德2)
up110(德3)
fz(飞机)
up002(飞机)
up003(飞机)
up203(飞机)
fz(村)
up002(村)
fz(炼金)
up200(炼金)
up320(炼金)
up420(炼金)
'''],
    
    
    
    '极难': ['艾蒂安', '''
毛1=[飞镖猴,[1025,242]]
毛2=[飞镖猴,[567,674]]#6 [740,194]
毛3=[飞镖猴,[169,582]]#6[229,272]

艾蒂安=[英雄,[778,394]]#9
永久钉子=[刺钉工厂,[289,363]]#9
航母=[海盗猴,[971,644]]#35
猴村1=[猴子村,[281,298]]#50
炼金1=[炼金术士,[236,350]]
# 死灵法=[法师猴,[401,419]]#48
森林=[德鲁伊,[401,419]]#48
飞机2=[皇家飞行员,[112,286]]#13
飞机1=[皇家飞行员,[112,352]]#13

fz(毛1)
fz(毛2)
fz(毛3)
startgame(2)
fz(艾蒂安)
fz(航母)
fz(永久钉子)
fz(森林)
up110(森林)
up010(航母)
fz(猴村1)
up102(猴村1)
up130(森林)
fz(飞机1)
up201(飞机1)
fz(炼金1)
up201(炼金1)
up020(航母)
up023(永久钉子)
tab(永久钉子,3)
up220(航母)
up320(航母)
up203(飞机1)
# up301(炼金1)
up203(猴村1)
up401(炼金1)
up204(飞机1)
up520(航母)
fz(飞机2)
up502(飞机2)
up205(飞机1)
up501(炼金1)
up250(森林)
up025(永久钉子)
'''],
},
    '避难所': {'简单': ['任意英雄', '''
hero=[英雄,[633, 181]]
sniper=[狙击手猴,[585, 99]]
fz(hero)
startgame(2)
fz(sniper)
up204(sniper)
'''],
            '放气': ['任意英雄', '''
sniper([579, 180])
sniper([579, 180],'025')
alchemist([633, 181])
alchemist([633, 181],'420')
village([596, 116])
village([596, 116],'230')
# 放置完毕开始
key(Key.space)
time.sleep(1)
key(Key.space)
'''],
            '极难': ['艾蒂安', '''
艾蒂安=[英雄,[201,333]]
sniper1=[狙击手猴,[790,151]]#446,189
sniper2=[狙击手猴,[ 479,193]]
sniper3=[狙击手猴,[541,59]]#一和3换一下位置
sniper4=[狙击手猴,[758,56]]
vallage=[猴子村,[481,109]]
德鲁伊1=[德鲁伊,[893,310]]
飞机1=[皇家飞行员,[652,689]]
飞机2=[皇家飞行员,[910,631]]
fz(艾蒂安)
# startgame()
fz(sniper1)
tab(sniper1,3)
up100(sniper1)
startgame()
fz(德鲁伊1)
up130(德鲁伊1)
fz(vallage)
up002(vallage)
fz(sniper2)
up032(sniper2)
up202(vallage)
up220(sniper1)
fz(sniper3)
up024(sniper3)
#缺点知识打不过需要补充输出
fz(飞机1)

up302(飞机1)
up203(vallage)
up052(sniper2)
tab(sniper2,1)
up150(德鲁伊1)
up420(sniper1)
up005(sniper3)
up025(sniper3)
fz(sniper4)
up204(sniper4)
up520(sniper1)
fz(飞机2)
up502(飞机1)
up205(飞机2)


''']
            },
    '峡谷': {'极难': ['艾蒂安', '''

sniper([68, 706-32])
dart([517, 577])
dart([517, 577],'020')
startgame()
hero([287, 525])
dart([517, 609-32],'022')
dart([517, 609-32],'023')
sniper([68, 674],'102')
ace([203, 567])
ace([203, 567],'003')
ace([203, 567],'203')
alchemist([233, 515])
alchemist([233, 515],'401')
village([243, 642])
village([243, 642],'200')
village([243, 642],'202')
ace1=[皇家飞行员,[138, 628]]
fz(ace1)
up402(ace1)
# ace([138, 628])
# ace([138, 628],'003')
# ace([138, 628],'203')
village([243, 642],'203')
ace([203, 567],'204')
sniper([68, 674],'402')
spike([300, 575])
spike([300, 575],'250')

up502(ace1)
# ace([153, 692])

# ace([153, 692],'502')
pilot([504,133])
pilot([504,133],'502')
alchemist([233, 515],'501')
'''],

           '简单': ['灵机', '''
英雄=[英雄,[893,744]]
飞镖猴1=[飞镖猴,[146,350]]
飞镖猴2=[飞镖猴,[525,573]]
大炮1=[大炮,[733,120]]
回旋镖猴1=[回旋镖猴,[283,542]]
回旋镖猴2=[回旋镖猴,[847,217]]
fz(英雄)
startgame(2)
fz(飞镖猴1)
fz(飞镖猴2)
up004(飞镖猴2)
up024(飞镖猴2)
fz(回旋镖猴1)
up302(回旋镖猴1)
fz(回旋镖猴2)
up302(回旋镖猴1)
up024(飞镖猴1)
fz(大炮1)
up042(大炮1)
'''],
'点击':['布里克尔','''
click([726,57],times=24,cd=0.01)
'''],

           },
    '水淹山谷': {
        '简单': ['灵机', '''
英雄=[英雄,[268,543]]

狙击手1=[狙击手猴,[141,543]]
狙击手2=[狙击手猴,[136,73]]
fz(英雄)
startgame(2)
tab(英雄,3)
fz(狙击手1)
up024(狙击手1)
fz(狙击手2)
tab(狙击手2,3)
up203(狙击手2)
    '''],
        '极难': ['艾蒂安', '''
hero([511, 283])
sub([733, 155])
sub([733, 559])
# 放置完毕开始
key(Key.space)
time.sleep(1)
key(Key.space)
sub([733, 559],'031')
sub([733, 155],'204')
buccaneer([790, 200])
buccaneer([790, 200], '020')
buccaneer([790, 200], '520')
ice([792, 93])
ice([792, 93], '041')
village([865, 70])
village([865, 70],'203')
ace([916, 165])
ace([916, 165], '205')
tack([663, 110])
tack([663, 110],'520')
# sub([666, 44])
# sub([666, 44],'250')
sniper([947, 92])
sniper([947, 92],'502')
alchemist([794, 151])
alchemist([794, 151],'205')
'''],
'点击':['布里克尔','''
英雄=[英雄,[746,488]]
潜艇1=[猴子潜艇,[772,634]]
潜艇2=[猴子潜艇,[700,115]]
潜艇3=[猴子潜艇,[781,568]]
海盗1=[海盗猴 ,[721,534]]
海盗2=[海盗猴 ,[721,588]]
狙击=[狙击手猴,[189,551]]
冰=[冰猴,[733,429]]
猴村1=[猴子村,[814,501]]
猴村2=[猴子村,[801,427]]
图钉=[图钉塔,[665,463]]
炼金=[炼金术士,[538,426]]
胶水=[胶水炮手,[812,360]]
刺钉风暴=[刺钉工厂,[497,491]]
fz(潜艇1)
startgame(2)
time.sleep(3)
fz(潜艇2,slow=True)
fz(英雄)
fz(海盗1)
up010(海盗1)
up220(海盗1)
fz(狙击,slow=True)
up010(狙击)
tab(狙击,3)
fz(海盗2)
up210(海盗2)
up301(潜艇1)
up220(海盗2)
ability('1',cd=5)
up230(海盗2)
# ability('1')
ability('2')
ability('1',cd=5)
up320(海盗1)
up401(潜艇1)
ability('1')
# abilities('1')
up402(潜艇1)
up402(潜艇2)
up240(海盗2)
run_thread(abilities,('123',2))
run_thread(cricle_ability,('4',[786,288]))#线程会干扰，所以放后面点
up250(海盗2)#之前容易g

up520(海盗1)
fz(冰)
up032(冰)
fz(猴村1)
up002(猴村1)
fz(猴村2)
up202(猴村2)
fz(图钉)
up204(图钉)
up302(猴村2)
fz(炼金)
up420(炼金)
up032(猴村1)
up205(图钉)
up402(猴村2)
fz(胶水)
tab(胶水,3)
up023(胶水)

fz(刺钉风暴)
up240(刺钉风暴)
# fz(潜艇3)
# #040的情况下98偶尔会g
# up240(潜艇3)
run_thread(abilities,('1235',2))#不知道什么bug后面要加个数字
up420(狙击)
'''],
},
    '炼狱': {
        '放气': ['', '''
狙击手0=[狙击手猴,[1093,370]]
猴村0=[猴子村,[1123,425]]
fz(狙击手0)
up025(狙击手0)
startgame(2)

fz(猴村0)
up230(猴村0)
    '''],  # 双金打法
        '极难': ['昆西', '''
kunxi=[英雄,[600,501]]
sub=[猴子潜艇,[856,174]]
dart=[飞镖猴,[338,192]]
sniper2=[狙击手猴,[1092,433]]
sniper3=[狙击手猴,[1146,400]]
sniper1=[狙击手猴,[1080,392]]
sniper4=[狙击手猴,[1146,495]]
sniper5=[狙击手猴,[1103,473]]
alchemist=[炼金术士,[1147-1,447]]
vallage=[猴子村,[1127,344]]
fz(kunxi)
key(Key.space)
time.sleep(1)
key(Key.space)

fz(dart)
fz(sniper1)
tab(sniper1,3)
up100(sniper1)
fz(sub)
up202(sub)
fz(vallage)
up002(vallage)
fz(sniper2)
up002(sniper2)
up032(sniper2)
up102(vallage)
up220(sniper1)
fz(alchemist)
up401(alchemist)
up203(vallage)
up052(sniper2)
tab(sniper2,1)
up420(sniper1)
up501(alchemist)
fz(sniper3)
up005(sniper3)
up025(sniper3)
fz(sniper4)
up204(sniper4)
fz(sniper5)
up022(sniper5)
up520(sniper1)
#到这已经过了，单金的钱用完了
up205(sub)
up025(dart)
'''],

        '简单': ['灵机', '''
英雄=[英雄,[1097,378]]

飞镖猴1=[飞镖猴,[596,263]]
飞镖猴2=[飞镖猴,[594,496]]
大炮1=[大炮,[64,475]]
回旋镖猴1=[回旋镖猴,[343,193]]
回旋镖猴2=[回旋镖猴,[101,432]]
fz(英雄)
startgame(2)
fz(飞镖猴1)
fz(飞镖猴2)
up004(飞镖猴2)
up024(飞镖猴2)
fz(回旋镖猴1)
up302(回旋镖猴1)
fz(回旋镖猴2)
up302(回旋镖猴1)
up024(飞镖猴1)
fz(大炮1)
up042(大炮1)
'''],
        '点击': ["昆西", '''
英雄=[英雄,[595,496]]
飞镖猴1=[飞镖猴,[359,191]]
猴子潜艇1=[猴子潜艇,[824,172]]
猴子潜艇2=[猴子潜艇,[326,566]]
狙击手猴1=[狙击手猴,[312,183]]
猴村1=[猴子村,[65,341]]
直升机=[直升机飞行员,[73,426]]
炼金=[炼金术士,[56,493]]
炼金1=[炼金术士,[592,209]]
法师猴1=[法师猴,[588,271]]
刺钉工厂1=[刺钉工厂,[1134,492]]
冰猴1=[冰猴,[881,575]]
fz(英雄)
startgame(2)
fz(飞镖猴1)
fz(猴子潜艇1)
fz(狙击手猴1)
tab(狙击手猴1,3)
up202(猴子潜艇1)
up100(狙击手猴1)
up203(猴子潜艇1)
up002(飞镖猴1)
fz(猴村1)
fz(直升机)
up202(直升机)
fz(炼金)
up200(炼金)
up302(直升机)
up300(炼金)
up020(猴村1)
up420(炼金)
up220(猴村1)
up402(直升机)
fz(法师猴1)
up025(法师猴1)
fz(炼金1)
up420(炼金1)
up502(直升机)
fz(刺钉工厂1)
up205(刺钉工厂1)
# fz(猴子潜艇2)
# up042(猴子潜艇2)
# fz(刺钉工厂1)
# up020(刺钉工厂1)
# up420(刺钉工厂1)
# fz(冰猴1)
# up032(冰猴1)
# abilities("123")

    '''],
    },
    '血腥水坑': {'极难': ['艾蒂安', '''
hero([352, 343])
dart([869, 553])
startgame()
sniper([494, 90])
sniper([506, 170])

sniper([506, 170], '022')
sub([849, 140-32])
sub([849, 140-32], '202')
sniper([494, 90], '102')
village([426, 170])
village([426, 170], '002')
sniper([506, 170], '024')
alchemist([566, 251])
alchemist([566, 251], '401')
ace([716, 244])
ace([716, 244], '203')
village([426, 170], '203')
druid([375, 106])
druid([375, 106], '051')
ace([716, 244], '204')
ace([716, 244], '205')
sniper([494, 90], '502')
ace([320, 271])
ace([320, 271], '502')
alchemist([300, 200])
alchemist([300, 200],'205')
buccaneer([430, 470])
buccaneer([430, 470], '520')
sub([157, 298])
sub([157, 298], '250')
'''],

             '简单': ['灵机', '''
英雄=[英雄,[82,185]]

狙击手1=[狙击手猴,[702,212]]
狙击手2=[狙击手猴,[308,214]]
fz(英雄)
startgame(2)
tab(英雄,3)
fz(狙击手1)
up024(狙击手1)
fz(狙击手2)
tab(狙击手2,3)
up203(狙击手2)
'''],
             },
    '工坊': {'极难': ['艾蒂安', '''
sniper1=[狙击手猴,[728, 301]]
毛毛=[飞镖猴,[481,357]]
hero([722, 380-32])
fz(毛毛)
工程师1=[工程师猴,[373, 351]]
工程师2=[工程师猴,[709, 63]]
法师=[法师猴,[650,344]]
永钉=[刺钉工厂,[1130, 501]]
fz(sniper1)
click([729, 300])
key(Key.tab, times=3)
click(global_point_map['game_rightdown'], times=2, cd=0.1)

startgame()
wizard([650, 344])
wizard([650, 344], '020')
spike([1130, 501])
spike([1130, 501], '002')
up102(sniper1)
fz(工程师1)
up004(工程师1)
spike([1130, 501], '203')
alchemist([1025, 585])
alchemist([1025, 585],'301')
village([692, 458])
village([692, 458], '102')
spike([1130, 501], '204')
tab(永钉,3)
up402(sniper1)
village([692, 458], '203')
druid([633, 297])
druid([633, 297], '140')
spike([1130, 501], '205')
ace([748, 542])
druid([633, 297], '150')
fz(工程师2)
up205(工程师2)
迫击炮=[迫击炮猴,[551,503]]
fz(迫击炮)
aim(迫击炮,[791, 11])
up025(迫击炮)
ace([748, 542], '205')
sniper([729, 300], '502')
up025(法师)
'''],

           '简单': ['灵机', '''
英雄=[英雄,[845,678]]

飞镖猴1=[飞镖猴,[726,355]]
飞镖猴2=[飞镖猴,[667,354]]
大炮1=[大炮,[90,480]]
回旋镖猴1=[回旋镖猴,[684,476]]
回旋镖猴2=[回旋镖猴,[849,291]]
fz(英雄)
startgame(2)
fz(飞镖猴1)
fz(飞镖猴2)
up004(飞镖猴2)
up024(飞镖猴2)
fz(回旋镖猴1)
up302(回旋镖猴1)
fz(回旋镖猴2)
up302(回旋镖猴1)
up024(飞镖猴1)
fz(大炮1)
up042(大炮1)
'''],
           },
    '方院': {'极难': ['艾蒂安', '''
狙击1=[狙击手猴,[732, 659]]
毛毛1=[飞镖猴,[611, 223-32]] 
毛毛2=[飞镖猴,[575, 629-32]]
毛毛3=[飞镖猴,[291, 417-32]]
艾蒂安=[英雄,[738, 348]]
潜艇1=[猴子潜艇,[685, 424-32]]
飞机1=[皇家飞行员,[798, 410]]
炼金1=[炼金术士,[769, 473]]
猴村1=[猴子村,[706, 513]]
森林=[德鲁伊,[620, 531]]
飞机2=[皇家飞行员,[893, 541]]
胶水=[胶水炮手,[1115,298]]
永钉=[刺钉工厂,[816, 626-32]]
迫击炮=[迫击炮猴,[1072,590]]
fz(毛毛1)
fz(毛毛2)
fz(毛毛3)
startgame()
fz(艾蒂安)
fz(狙击1)
fz(潜艇1)
up202(潜艇1)
fz(飞机1)
up103(飞机1)
fz(炼金1)
up201(炼金1)
up203(飞机1)
up120(狙击1)
tab(狙击1,3)
aimcamo(狙击1)
up120(狙击1)
tab(狙击1,1)
up401(炼金1)
fz(猴村1)
up203(猴村1)
fz(森林)
up150(森林)
fz(飞机2)
up502(飞机2)
up205(飞机1)
dm([595, 180-32])
dm([1046, 431-32])
dm([596, 664-32])
dm([107, 415-32])
fz(永钉)
up250(永钉)
fz(胶水)
up520(胶水)
fz(迫击炮)
up025(迫击炮)
up501(炼金1)
'''],

           '简单': ['灵机', '''
英雄=[英雄,[82,185]]

狙击手1=[狙击手猴,[774,327]]
狙击手2=[狙击手猴,[238,525]]
fz(英雄)
startgame(2)
tab(英雄,3)
fz(狙击手1)
up024(狙击手1)
fz(狙击手2)
tab(狙击手2,3)
up203(狙击手2)
'''],
           },
    '黑暗城堡': {

        '简单': ['灵机', '''
英雄=[英雄,[554,284]]

狙击手1=[狙击手猴,[1039,340]]
狙击手2=[狙击手猴,[1042,441]]
fz(英雄)
startgame(2)
tab(英雄,3)
fz(狙击手1)
up024(狙击手1)
fz(狙击手2)
tab(狙击手2,3)
up203(狙击手2)
'''],

        '放气': ['奥本', '''
village1=[猴子村,[718,225]]
village2=[猴子村,[633, 221]]
hero=[英雄,[619,311]]
alchemist=[炼金术士,[676,307]]
毛毛=[飞镖猴,[345,228]]
回旋镖=[回旋镖猴,[366,337]]
工程师=[工程师猴,[350,553]]
忍者=[忍者猴,[361,444]]
忍者1=[忍者猴,[429,123]]
忍者2=[忍者猴,[1193,450]]
fz(village1)
fz(village2)
up002(village1)
up102(village2)
# hero([676,307])
fz(hero)
sub([774,294])
sub([774,294],'203')
startgame()
sub([790,219])
sub([790,219],'203')
wizard([554,314])
wizard([554,314],'023')
fz(alchemist)
up401(alchemist)
msale(village1)
msale(village2)
sub([790,219],'204')
sub([774,294],'204')
fz(毛毛)
fz(回旋镖)
fz(工程师)
fz(忍者)
    '''],
        '极难': ['艾蒂安', '''
英雄=[英雄,[718,300]]
毛毛1=[飞镖猴,[1031,360]]
工程师1=[工程师猴,[1035,404]]
海盗=[海盗猴,[796,231]]
fz(工程师1)
fz(毛毛1)

startgame(2)
fz(英雄)
up010(工程师1)
up013(工程师1)

sub([791, 325-32])
sub([791, 325-32], '001')
ace([544, 220-32])
ace([544, 220-32], '002')
ace([544, 220-32], '203')
alchemist([591, 258])
alchemist([591, 258], '200')
village([658, 235])
village([658, 235], '002')
up023(毛毛1)
pilot([665, 140])
# 拆树
dm([176, 139-32])
pilot([665, 140], '302')
alchemist([591, 258], '400')
village([658, 235], '203')
dm([168, 316-32])
dm([125, 513-32])
dm([135, 675-32])
pilot([665, 140], '502')
ace([544, 220-32], '204')
ace([544, 220-32], '205')
alchemist([591, 258], '500')
alchemist([546, 311])
alchemist([546, 311],'205')
# sub1=[猴子潜艇,[791, 325-32]]
# up205(sub1)
飞行员=[皇家飞行员,[546, 122]]
fz(飞行员)
up502(飞行员)
fz(海盗)
up520(海盗)
'''],
        '点击': ['灵机', '''
英雄=[英雄,[476,168]]
胶水1=[胶水炮手,[486,218]]
炼金1=[炼金术士,[556,318]]
炼金2=[炼金术士,[1089,575]]
炼金3=[炼金术士,[661,240]]
图钉1=[图钉塔,[511,307]]
冰猴1=[冰猴,[554,277]]
大炮1=[大炮,[605,272]]
大炮2=[大炮,[654,293]]
猴村1=[猴子村,[598,209]]
毛毛1=[飞镖猴,[1031,360]]
工程师1=[工程师猴,[1035,404]]
刺钉1=[刺钉工厂,[1084,453]]
刺钉2=[刺钉工厂,[1097,373]]
回旋镖1=[回旋镖猴,[598,148]]
回旋镖2=[回旋镖猴,[531,179]]
回旋镖3=[回旋镖猴,[719,233]]
回旋镖4=[回旋镖猴,[709,305]]
回旋镖5=[回旋镖猴,[660,177]]
回旋镖6=[回旋镖猴,[717,185]]
fz(工程师1)
fz(毛毛1)
startgame(2)
up010(工程师1)
up013(工程师1)
fz(英雄)
fz(刺钉1)
fz(大炮1)
up103(大炮1)
up204(大炮1)
up203(刺钉1)
fz(炼金1)
tab(炼金1,3)
up300(炼金1)
up301(炼金1)
fz(猴村1)
up020(猴村1)
up420(猴村1)
fz(图钉1)
up204(图钉1)
up204(刺钉1)#补充输出
up401(炼金1)
tab(刺钉1,1)
fz(炼金2)
up320(炼金2)
up205(图钉1)
up205(刺钉1)
fz(冰猴1)
up240(冰猴1)
fz(胶水1)
up013(胶水1)
tab(胶水1,3)
fz(回旋镖1)
up024(回旋镖1)
tab(回旋镖1,3)
fz(回旋镖2)
up024(回旋镖2)
tab(回旋镖2,3)
fz(回旋镖3)
up024(回旋镖3)
tab(回旋镖3,3)
fz(炼金3)
up401(炼金3)
fz(大炮2)
up204(大炮2)
fz(回旋镖4)
up024(回旋镖4)
tab(回旋镖4,3)
fz(回旋镖5)
up024(回旋镖5)
tab(回旋镖5,3)
up420(炼金2)
fz(回旋镖6)
up024(回旋镖6)
tab(回旋镖6,3)
fz(刺钉2)
up020(刺钉2)
up420(刺钉2)
'''],
    },
    '泥泞的水坑': {
        '简单': ['灵机', '''
英雄=[英雄,[533,120]]

狙击手1=[狙击手猴,[375,636]]
狙击手2=[狙击手猴,[806,148]]
fz(英雄)
startgame(2)
tab(英雄,3)
fz(狙击手1)
up024(狙击手1)
fz(狙击手2)
tab(狙击手2,3)
up203(狙击手2)
    '''],
        '极难': ['艾蒂安', '''
hero([727, 331])
dart([352, 230])
sniper ([828, 532])
sniper([828, 532], '001')
# 放置完毕开始
key(Key.space)
time.sleep(1)
key(Key.space)
sniper([828, 532], '022')
# print('[%s] 狙击手1 升级至002' % get_datetime())
sniper([828, 532], '023')
sniper([856, 586])
sniper([856, 586], '102')
# 修改强力模式
print('[%s] 狙击手2 修改强力模式, !!用于破铅气球!!' % get_datetime())
click([856, 586])
key(Key.tab, times=3)
click(global_point_map['game_rightdown'], times=2, cd=0.1)
alchemist([827, 498-32])
alchemist([827, 498-32], '201')
sniper([828, 532], '024')
village([846, 434-32])
village([846, 434-32], '202')
alchemist([827, 498-32], '401')
village([846, 434-32], '203')
pilot([747, 505-32])
pilot([747, 505-32], '402')
pilot([747, 505-32], '502')
ace([969, 508-32])
ace([969, 508-32], '204')
ace([969, 508-32], '205')
sub([889, 360-32])
sub([889, 360-32], '240')
sub([889, 360-32], '250')
alchemist([827, 498-32], '501')
sniper([676, 402-32])
sniper([676, 402-32], '502')
alchemist([778, 579-32])
alchemist([778, 579-32], '205')
''']},
    '#哎哟':
    {

        '简单': ['灵机', '''
英雄=[英雄,[1083,648]]

飞镖猴1=[飞镖猴,[487,301]]
飞镖猴2=[飞镖猴,[481,476]]
大炮1=[大炮,[599,170]]
回旋镖猴1=[回旋镖猴,[680,295]]
回旋镖猴2=[回旋镖猴,[684,476]]
fz(英雄)
startgame(2)
fz(飞镖猴1)
fz(飞镖猴2)
up004(飞镖猴2)
up024(飞镖猴2)
fz(回旋镖猴1)
up302(回旋镖猴1)
fz(回旋镖猴2)
up302(回旋镖猴2)
up024(飞镖猴1)
fz(大炮1)
up042(大炮1)
'''],

        '极难': ['艾蒂安', '''
hero([483, 327-32])
sniper([486, 505-32])
sub([694, 420-32])
# 放置完毕开始
key(Key.space)
time.sleep(1)
key(Key.space)
sub([694, 420-32], '202')
sniper([486, 505-32], '102')
village([382, 419-32])
village([382, 419-32], '102')
buccaneer([553, 415-32])
buccaneer([553, 415-32], '320')
village([382, 419-32], '203')
sniper([486, 505-32], '302')
ace([364, 342-32])
ace([364, 342-32], '203')
buccaneer([553, 415-32], '520')
druid([379, 492-32])
druid([379, 492-32], '050')
ace([364, 342-32], '204')
ace([364, 342-32], '205')
sub([553, 469-32])
sub([553, 469-32], '250')
alchemist([492, 350-32])
alchemist([492, 350-32], '420')
alchemist([492, 350-32], '520')
village([382, 419-32], '204')
spike([497, 249-32])
spike([497, 249-32], '250')
''']},

    '': {'极难': ['艾蒂安', '''

''']},
    '': {'极难': ['艾蒂安', '''

''']},
    '': {'极难': ['艾蒂安', '''

''']},
    '': {'极难': ['艾蒂安', '''

''']},
    '': {'极难': ['艾蒂安', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''

''']},
    '': {'': ['', '''
''']},
    '': {'': ['', '''
''']},
    '': {'': ['', '''
''']},
    '': {'': ['', '''
''']},
    '': {'': ['', '''
''']},








    '水淹山谷单金极难': [
        '''
# 单金失败版本
sub([686,127])
key(Key.space)
time.sleep(1)
key(Key.space)
sub([732,558])
hero([264,580])
sub([686,127],'001')
sub([732,558],'001')
sub([686,127],'201')
sub([732,558],'201')
sniper([175,527])
click([175,527])
key(Key.tab, times=3)
sniper([175,527],'100')
# tab([],3)
sub([732,558],'202')
sniper([209,572])
sniper([209,572],'020')
sub([686,127],'202')
sniper([209,572],'022')
sniper([175,527],'102')
village([240,521])
village([240,521],'002')
sniper([175,527],'203')
sub([686,127],'402')
sniper([209,572],'032')
alchemist([191,481])
alchemist([191,481],'300')
village([240,521],'003')
village([240,521],'203')
sniper([175,527],'204')#又一g点
alchemist([191,481],'400')
sniper([209,572],'042')
sniper([128,536])
click([128,536])
key(Key.tab, times=3)
sniper([128,536],'020')
sniper([128,536],'420')#一g点
sniper([209,572],'052')
click([209,572])
key(Key.tab, times=1)
sub([732,558],'302')
sniper([175,527],'205')
click([175,527])
key(Key.tab, times=2)
alchemist([191,481],'500')
sniper([162,581])
sniper([162,581],'032')
sniper([115,586])
sniper([115,586],'032')
ace([278,430])
ace([278,430],'502')
'''
    ],

    # #刷金气球打新手中级（标准）


    '炼狱简单': [['pre', '''
英雄=[英雄,[1132,383]]
startgame(2)
狙击手1=[狙击手猴,[1095,418]]
狙击手2=[狙击手猴,[1133,441]]
fz(英雄)
tab(英雄,3)
fz(狙击手1)
up024(狙击手1)
fz(狙击手2)
tab(狙击手2,3)
up203(狙击手2)
'''
              ]],


    '龟裂之地极难':  # 需要双金
    [['pre', '''
刺钉=[刺钉工厂,[302,147]]
飞机1=[皇家飞行员,[451,102]]
图钉=[图钉塔,[302,147]]
刺钉厂=[刺钉工厂,[245,192]]
# 这个名字=[图钉塔,[302,147]]
飞机2=[皇家飞行员,[306,293]]
猴子村啊=[猴子村,[386,170]]
艾蒂安=[英雄,[409,264]]
fz(艾蒂安)
startgame()
fz(图钉)
fz(飞机1)
fz(飞机2)
fz(刺钉厂)
fz(猴子村啊)
up220(刺钉厂)
up202(图钉)
up230(刺钉厂)
up002(猴子村啊)
up205(图钉)
up203(猴子村啊)
up205(飞机1)
up502(飞机2)
up250(刺钉厂)

'''
      ]],


    "放气双金通用": [['pre', '''
狙击手0=[狙击手猴,[336,323]]
猴村0=[猴子村,[336,323]]
fz(狙击手0)
up025(狙击手0)
startgame(2)
fz(猴村0)
up230(猴村0)


'''
                ]],
    '中级金气球通用': [['pre', '''
ice=[冰猴,[841,505]]
dart=[飞镖猴,[238,201]]
sawuda=[英雄,[351,496]]
tack=[图钉塔,[419,501]]
alchemist=[炼金术士,[344,415]]
village=[猴子村,[415,395]]
fz(sawuda)
startgame()
fz(dart)
fz(tack)
fz(ice)
up002(ice)
fz(alchemist)
up201(alchemist)
up204(tack)
up203(ice)
up401(alchemist)
up205(tack)
fz(village)
up030(village)
''']],



    '': [['pre', '''




''']],
    '': [['pre', '''




''']],
    '': [['pre', '''




''']],
    '': [['pre', '''




''']],
    '': [['pre', '''




''']],
    '': [['pre', '''




''']],
    '': [['pre', '''




''']],
    '': [['pre', '''




''']],






}
