
print('将运行示范打法，请打开加密地图的沙盒模式再运行')
# 这是猴子名对应的英文
# dart飞镖猴q
# boomerang回旋镖猴w
# bomb大炮e
# tack图钉塔r
# ice冰猴t
# glue胶水炮手y
# sniper狙击手猴z
# sub猴子潜艇x
# buccaneer海盗猴c
# ace皇家飞行员v
# pilot直升机飞行员b
# mortar迫击炮猴n
# gunner机枪猴m
# wizard法师猴a
# super超猴侠s
# ninja忍者猴d
# alchemist炼金术士f
# druid德鲁伊g
# farm香蕉农场h
# engineer工程师猴l
# spike刺钉工厂j
# village猴子村k
# hero英雄u
# 加速回合(20)

# 英雄1=[大炮,[447,435]]
# 英雄1=[飞镖猴,[447,435]]
# 英雄1=[回旋镖猴,[447,435]]
# 英雄1=[大炮,[447,435]]
# 英雄1=[图钉塔,[447,435]]
# 英雄1=[冰猴,[447,435]]
# 英雄1=[胶水炮手,[447,435]]
# 英雄1=[狙击手猴,[447,435]]
# 英雄1=[猴子潜艇,[447,435]]
# 英雄1=[海盗船,[447,435]]
# 英雄1=[皇家飞行员,[447,435]]

直升机=[直升机飞行员,[962,297]]
迫击炮=[迫击炮猴,[953,89]]
机枪=[机枪猴,[856,50]]
法师=[法师猴,[941,191]]
# 英雄1=[超猴侠,[447,435]]
忍者=[忍者猴,[719,23]]
# 英雄1=[炼金术士,[447,435]]
# 英雄1=[德鲁伊,[447,435]]
市场=[香蕉农场,[1009,488]]
陷阱=[工程师猴,[791,32]]
超频=[工程师猴,[869,143]]
永钉=[刺钉工厂,[889,424]]
# 英雄1=[猴子村,[447,435]]
hero=[英雄,[834,290]]

# 英雄1=[飞镖猴,[447,435]]
# 英雄1=[回旋镖猴,[447,435]]
# 英雄1=[海盗船,[447,435]]
# 英雄1=[皇家飞行员,[447,435]]
# 英雄1=[忍者猴,[447,435]]
# 英雄1=[工程师猴,[447,435]]

#  up010(海盗1)
# click([1,1],times=100)
dm([539, 224])
startgame()
startgame(1)
fz(hero)
uphero(15)
run_thread(abilities,('12',))
fz(忍者)
aimcamo(忍者)
fz(永钉)
up025(永钉)
tab(永钉,3)
fz(迫击炮)
aim(迫击炮,[100,100])
fz(陷阱)
up015(陷阱)
aimtool(陷阱,[814,140])
fz(法师)
up220(法师)
aimtool(法师,[814,140])
fz(机枪)
tab(机枪)
aimtool(机枪,[100,100])
fz(直升机)
tab(直升机)
up040(直升机)
tab(直升机)
aimtool(直升机,[337,0],[337,200])


fz(超频)
up050(超频)
msale(机枪)
time.sleep(4)
ability('1')
ability('4',[941,191],[585, 286])
ability('6',[719,23])
fz(市场)
cricle_moveto([1009,488],cd=2,times=2)#或者下面这个 市场[1] 表示市场的第2个信息，即是[1009,488]
#cricle_moveto(市场[1],cd=2,times=2
up025(市场)
if after_round(18):#不放有概率g
 print('[%s]到18回合了' % get_datetime())
 ability('3')
# #仅初级

input()






